In [1]:
import pandas

In [2]:
data = pandas.read_csv('titanic.csv', index_col='PassengerId')

In [3]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S

In [4]:
 data.groupby('Sex').count()

,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Sex,,,,,,,,,,
female,314,314,314,261,314,314,314,314,97,312
male,577,577,577,453,577,577,577,577,107,577

In [5]:
data.groupby('Survived').count()

          Pclass  Name  Sex  Age  SibSp  Parch  Ticket  Fare  Cabin  Embarked
Survived
0            549   549  549  424    549    549     549   549     68       549
1            342   342  342  290    342    342     342   342    136       340

In [6]:
data.groupby('Pclass').count()

        Survived  Name  Sex  Age  SibSp  Parch  Ticket  Fare  Cabin  Embarked
Pclass
1            216   216  216  186    216    216     216   216    176       214
2            184   184  184  173    184    184     184   184     16       184
3            491   491  491  355    491    491     491   491     12       491

In [7]:
216. / len(data) * 100

24.242424242424242

In [8]:
type(data)

pandas.core.frame.DataFrame

In [9]:
type(data.Age)

pandas.core.series.Series

In [10]:
data.Age.dropna()

PassengerId
1      22
2      38
3      26
4      35
5      35
7      54
8       2
9      27
10     14
11      4
12     58
13     20
14     39
15     14
16     55
17      2
19     31
21     35
22     34
23     15
24     28
25      8
26     38
28     19
31     40
34     66
35     28
36     42
38     21
39     18
       ..
857    45
858    51
859    24
861    41
862    21
863    48
865    24
866    42
867    27
868    31
870     4
871    26
872    47
873    33
874    47
875    28
876    15
877    20
878    19
880    56
881    25
882    33
883    22
884    28
885    25
886    39
887    27
888    19
890    26
891    32
Name: Age, dtype: float64

In [11]:
ages = data.Age.dropna()
ages.mean(), ages.median()

(29.69911764705882, 28.0)

In [12]:
data.columns

Index([u'Survived', u'Pclass', u'Name', u'Sex', u'Age', u'SibSp', u'Parch',
       u'Ticket', u'Fare', u'Cabin', u'Embarked'],
      dtype='object')

In [13]:
data.SibSp.corr(data.Parch)

0.41483769862015257